---
title: CriticalPathCollector
classe: Autodesk.Revit.DB.Analysis.CriticalPathCollector
namespace: Autodesk.Revit.DB.Analysis
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# CriticalPathCollector

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `criticalPathCollector.IsValidObject` | Boolean |
| `Void Dispose()` | `criticalPathCollector.Dispose()` | Void |
| `Double GetCalculatedFlow()` | `criticalPathCollector.GetCalculatedFlow()` | Double |
| `Double GetCalculatedPressureDrop()` | `criticalPathCollector.GetCalculatedPressureDrop()` | Double |
| `CriticalPathIterator GetCriticalPathCollectorIterator()` | `criticalPathCollector.GetCriticalPathCollectorIterator()` | CriticalPathIterator |
| `IEnumerator<MEPNetworkSegmentId> GetEnumerator()` | `criticalPathCollector.GetEnumerator()` | IEnumerator<MEPNetworkSegmentId> |
| `IList<MEPNetworkSegmentId> ToNetworkSegmentIds()` | `criticalPathCollector.ToNetworkSegmentIds()` | IList<MEPNetworkSegmentId> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```